#define _CRT_SECURE_NO_WARNINGS 1

//操作符
//#include<stdio.h>
//int main()
//{
//	////  除号(/) :两边都是整数，执行的就是整数除法(取整)。
//	////          :两边中有任意一边有浮点数，结果就是浮点数。
//	//int a = 9 / 2;	
//	//double b = 9 / 2;
//	//printf("%d %lf\n", a, b);  //可见 9 / 2的结果就是4。
//
//	//double c = 9.0 / 2;
//	//printf("%lf\n", c);
//
//	////  取模(%) :两边就必须是整数才可以。
//	////          :结果也一定为整数。
//	//int d = 9 % 2;
//	//double e = 9 % 2;
//	////double f = 9.0 % 2;  - error
//	////int g = 9.0 % 2;  - error
//	//printf("%d %lf\n", d, e);
//
//	//左移操作符和右移操作符 - 移的是二进制位
//	//左移：低位补0
//	
//	//右移又分：算术右移 - 高位补符号位 (vs就是这种移动方式)
//	//        : 逻辑右移 - 高位补0
//	int a = 4;
//	a = a >> 1;
//	printf("%d\n", a);
//	//在计算机中有原码、反码和补码之称
//	//原码 - 把一个数直接写出它的二进制序列
//	//反码 - 原码符号位不变，其他位按位取反
//	//补码 - 反码加1
//
//	//正整数 - 原码，反码，补码相同
//	//负整数 - 原码，反码，补码不同
//
//	//对于计算机来说，整数在内存中存放的是二进制的补码
//
//	int b = -1;        //1000 0000 0000 0000 0000 0000 0000 0001   -   -1的原码
//	b = b << 1;        //1111 1111 1111 1111 1111 1111 1111 1110   -   -1的反码
//	                   //1111 1111 1111 1111 1111 1111 1111 1111   -   -1的补码
//				   
//    printf("%d\n", b); //1111 1111 1111 1111 1111 1111 1111 1110   -   -1 << 1后的补码
//	                   //1111 1111 1111 1111 1111 1111 1111 1101   -   -1 << 1后的反码
//	                   //1000 0000 0000 0000 0000 0000 0000 0010   -   -1 << 1后的原码
//
//	int c = -1;        //1111 1111 1111 1111 1111 1111 1111 1111   -   -1的补码
//	c = c >> 1;        //1111 1111 1111 1111 1111 1111 1111 1111   -   -1 >> 1 后的补码
//	printf("%d\n", c); //1000 0000 0000 0000 0000 0000 0000 0001   -   -1 >> 1 后的原码
//
//	int d = 15;
//	//d = d >> -1;  //  error  标准未定义行为，不合法。(不能移动负数位)
//	return 0;
//}


//实现函数init() 初始化数组为全0
//实现print()  打印数组的每个元素
//实现reverse()  函数完成数组元素的逆置。
#include<stdio.h>
void Print(int* arr, int n)
{
	int i = 0;
	for (i = 0; i < n; i++)
	{
		printf("%d ", *(arr + i));
	}
}
void Init(int* arr, int n)
{
	while (n)
	{
		*(arr + n - 1) = 0;
		n--;
	}
}
void Reverse(int* arr, int n)
{
	int* left = arr;
	int* right = arr + n - 1;
	while (left < right)
	{
		int temp = *left;
		*left = *right;
		*right = temp;
		left++;
		right--;
	}
}
int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int sz = sizeof(arr) / sizeof(arr[0]);
	Print(arr, sz);
	Reverse(arr, sz);
	printf("\n");
	Print(arr, sz);
	Init(arr, sz);
	printf("\n");
	Print(arr, sz);
	return 0;
}